//* 207. 课程表
//* 124. 二叉树中的最大路径和
//* 301. 删除无效的括号
//* 31. 下一个排列
//* 437. 路径总和 III
//* 560. 和为 K 的子数组
//* 581. 最短无序连续子数组
// 128. 最长连续序列
// 322. 零钱兑换
// 494. 目标和
// 461. 汉明距离
// 438. 找到字符串中所有字母异位词
// 416. 分割等和子集
// 399. 除法求值
// 347. 前 K 个高频元素
// 338. 比特位计数
// 309. 买卖股票的最佳时机含冷冻期
// 312. 戳气球

// 297. 二叉树的序列化与反序列化
// 287. 寻找重复数
// 279. 完全平方数
// 239. 滑动窗口最大值
// 543. 二叉树的直径
// 42. 接雨水
// 39. 组合总和
// 32. 最长有效括号
// 15. 三数之和
// 4. 寻找两个正序数组的中位数
// 85. 最大矩形
// 75. 颜色分类

// 79. 单词搜索
// 160. 相交链表
// 198. 打家劫舍


// 239. 滑动窗口最大值 todo


// 防抖/节流
// ts类型体操


// 9.00-12:00 3
// 2.00-9.00 7 // 抽出半小时看算法手写 0.5中间吃晚饭


// 八股文顺序，看的过程中可以延伸
// 面试题4、5、3、1、2
// node面试题 
// 工程化 
// js手写题 
// css八股文
// 框架react 
// 框架vue 
// 面试引导 


// 算法 看labuladong有题解的
// https://leetcode.cn/problem-list/2cktkvj/
// codeTop
// https://leetcode.cn/problemset/

// ts体操 popular easy medium 
// https://typehero.dev/challenge/hello-world/solutions/2754 popular到medium
// https://github.com/type-challenges/type-challenges


//  暂停新题，将旧题反复看 
// ts next: popular
// 力抠next：codetop 83. 删除排序链表中的重复元素.js



